<?php

declare(strict_types=1);

namespace jblond\morse\CharacterSet;

class Thai implements Character
{
    /**
     * @var array|string[]
     */
    protected array $letters = [
        // Thai Alphabet => https://th.wikipedia.org/wiki/รหัสมอร์ส
        '10' => 'ก', '1010' => 'ข', '101' => 'ค', '10110' => 'ง', '10010' => 'จ',
        '1111' => 'ฉ', '1001' => 'ช', '1100' => 'ซ', '0111' => 'ญ', '100' => 'ด',
        '1' => 'ต', '10100' => 'ถ', '10011' => 'ท', '1000' => 'บ',
        '0110' => 'ป', '1101' => 'ผ', '10101' => 'ฝ', '01100' => 'พ', '0010' => 'ฟ',
        '11' => 'ม', '1011' => 'ย', '010' => 'ร', '0100' => 'ล', '011' => 'ว',
        '000' => 'ส', '0000' => 'ห', '10001' => 'อ', '11011' => 'ฮ', '01011' => 'ฤ',
        '01000' => 'ะ', '01' => 'า', '00100' => 'ิ', '00' => 'ี', '00110' => 'ึ',
        '0011' => 'ื', '00101' => 'ุ', '1110' => 'ู', '0' => 'เ', '0101' => 'แ',
        '01001' => 'ไ', '111' => 'โ', '00010' => 'ำ', '001' => '่', '0001' => '้',
        '11000' => '๊', '01010' => '๋', '01101' => 'ั', '11100' => '็', '11001' => '์',
        '10111' => 'ๆ', '11010' => 'ฯ',
    ];

    /**
     * @return array|string[]
     */
    public function get(): array
    {
        return $this->letters;
    }
}
